# BadViewForAttachedGroup Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..GroupFailures..::..BadViewForAttachedGroup Property
BuiltInFailures..::..GroupFailures Class See Also
---
Attached groups can only be created for view specific elements belonging to non-3d model views.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId BadViewForAttachedGroup { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property BadViewForAttachedGroup As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ BadViewForAttachedGroup {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..GroupFailures Class
Autodesk.Revit.DB Namespace